Repository: JunyuMu/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Probe_Calibrate.po
Languages: nb_no

source: This document describes the method for calibrating the x, y, and z offsets of an "automatic z probe" in Klipper. This is useful for users that have a `[probe]` or `[bltouch]` section in their config file.
nb_no: Dette dokumentet beskriver metoden for kalibrering av x, y, og z-forskyvning av en ?automatisk probe? i Klipper. Dette er nyttig for brukere som har en ?[probe]? eller ?[bltouch]?-del i oppsettsfilen sin.

source: Calibrating probe X and Y offsets
nb_no: Kalibrering av probeforskyvning for X og Y

source: Place a piece of blue painters tape (or similar) on the bed underneath the probe. Navigate to the OctoPrint "Terminal" tab and issue a PROBE command:
nb_no: Plasser en bit bl? maskeringstape (eller lignende) p? bunnplaten under proben. G? til ?Terminal?-fanen i OctoPrint og utf?r en ?PROBE?-kommando:

source: Place a mark on the tape directly under where the probe is (or use a similar method to note the location on the bed).
nb_no: Merk tapen akkurat under proben (eller bruk en lignende metode for ? merke posisjon p? bunnplaten).

source: Issue a `GET_POSITION` command and record the toolhead XY location reported by that command. For example if one sees:
nb_no: Utf?r en ?GET_POSITION?-kommando og ta vare p? verkt?yhodets XY-posisjon, som rapportert av kommandoen. For eksempel hvis man ser:

source: then one would record a probe X position of 46.5 and probe Y position of 27.
nb_no: vil man registrere en X-probeposisjon p? 46,5 og en Y-probeposisjon p? 27.

source: After recording the probe position, issue a series of G1 commands until the nozzle is directly above the mark on the bed. For example, one might issue:
nb_no: Etter ? ha registrert probeposisjon, send en rekke G1-kommandoer til tuten er direkte over merket p? bunnplaten. For eksempel kan man utf?re:

source: to move the nozzle to an X position of 57 and Y of 30. Once one finds the position directly above the mark, use the `GET_POSITION` command to report that position. This is the nozzle position.
nb_no: for ? flytte tuten til en X-posisjon p? 57, og Y-posisjon p? 30. N?r man finner posisjonen direkte over merket, kan man bruke ?GET_POSITION?-kommandoen for ? rapportere den posisjonen. Dette er tut-posisjonen.

source: The x_offset is then the `nozzle_x_position - probe_x_position` and y_offset is similarly the `nozzle_y_position - probe_y_position`. Update the printer.cfg file with the given values, remove the tape/marks from the bed, and then issue a `RESTART` command so that the new values take effect.
nb_no: ?x_offset? er dermed ?nozzle_x_position - probe_x_position? og ?y_offset? er ?nozzle_y_position - probe_y_position?. Oppdater printer.cfg-filen med angitte verdier, fjern tape/merker fra bunnplaten, og kj?r s? en ?RESTART?-kommando slik at de nye endringene anvendes.

source: Calibrating probe Z offset
nb_no: Kalibrering av probeforskyvning for Z

source: Providing an accurate probe z_offset is critical to obtaining high quality prints. The z_offset is the distance between the nozzle and bed when the probe triggers. The Klipper `PROBE_CALIBRATE` tool can be used to obtain this value - it will run an automatic probe to measure the probe's Z trigger position and then start a manual probe to obtain the nozzle Z height. The probe z_offset will then be calculated from these measurements.
nb_no: ? angi n?yaktig z_offset for proben er kritisk for n?yaktige utskrifter. z_offset er avstanden mellom tuten og bunnplaten n?r proben utl?ser. Klipper sitt ?PROBE_CALIBRATE?-verkt?y kan brukes til ? hente denne verdien. Den vil kj?re en automatisk probe for ? m?le probens Z-utl?serposisjon og s? starte en manuell probe for ? hente Z-h?yde for tuten. Probens z_offset vil s? bli regnet ut basert p? disse m?lingene.

source: This tool will perform an automatic probe, then lift the head, move the nozzle over the location of the probe point, and start the manual probe tool. If the nozzle does not move to a position above the automatic probe point, then `ABORT` the manual probe tool and perform the XY probe offset calibration described above.
nb_no: Verkt?yet vil utf?re en automatisk probe, l?fte hodet, flytte tuten over stedet for probingspunkt, og starte det manuelle probeverkt?yet. Hvis tuten ikke flytter til en posisjon over det automatiske probepunktet, vil ?ABORT? avslutte det manuelle probeverkt?yet og utf?re kalibrering av XY-probeforskyvning beskrevet ovenfor.

source: Note that if a change is made to the printer's motion system, hotend position, or probe location then it will invalidate the results of PROBE_CALIBRATE.
nb_no: Merk at hvis endringen gj?res for skriverens bevegegelsessystem, varmepunktsposisjon, eller probeposisjonen, vil den invalidere resultatet av ?PROBE_CALIBRATE?.

source: This command will run the probe ten times and produce output similar to the following:
nb_no: Denne kommandoen vil kj?re proben ti ganger og gi et resultat lignende f?lgende:

source: If the results of the test show a range value that is greater than 25 microns (.025mm) then the probe does not have sufficient accuracy for typical bed leveling procedures. It may be possible to tune the probe speed and/or probe start height to improve the repeatability of the probe. The `PROBE_ACCURACY` command allows one to run tests with different parameters to see their impact - see the [G-Codes document](G-Codes.md) for further details. If the probe generally obtains repeatable results but has an occasional outlier, then it may be possible to account for that by using multiple samples on each probe - read the description of the probe `samples` config parameters in the [config reference](Config_Reference.md#probe) for more details.
nb_no: Hvis resultatet av testen viser en spennviddeverdi h?yere en 25 mikrometer ?0,025 mm) vil proben ikke ha nok n?yaktighet for typiske bunnplateniveleringsprosedyrer. Det kan v?re mulig ? justere probehastighet og/eller probestarth?yde for ? forbedre gjentagbarheten for proben. ?PROBE_ACCURACY?-kommandoen lar deg kj?re tester med forskjellige parameter for ? se deres innvirkning. Sjekk ?[G-kodedokumentet](G-Codes.md)? for flere detaljer. Hvis proben generelt innhenter reproduserbare resultater, men har et sjeldent avvik n? og da, kan det v?re mulig ? ta h?yde for dette ved ? bruke flere samplinger for hver probe. Les beskrivelsen av probens ?sample?-oppsettsparameter i ?[oppsettsreferansen](Config_Reference.md#probe)? for flere detaljer.

source: If new probe speed, samples count, or other settings are needed, then update the printer.cfg file and issue a `RESTART` command. If so, it is a good idea to [calibrate the z_offset](#calibrating-probe-z-offset) again. If repeatable results can not be obtained then don't use the probe for bed leveling. Klipper has several manual probing tools that can be used instead - see the [Bed Level document](Bed_Level.md) for further details.
nb_no: Hvis probehastighet, samplingsantall, eller andre innstillinger trengs, kan du oppdatere skriverens printer.cfg-fil og kj?re ?RESTART?-kommandoen. Hvis dette gj?res er det en god id¨¦ ? ogs? [kalibrere z_offset](#calibrating-probe-z-offset) igjen. Hvis reproduserbare resultater ikke kan demonstreres, s? bruker du ikke proben for bunnplatenivelering. Klipper har flere manuelle probeverkt?y som kan brukes istedenfor. Sjekk ?[Bunnplateniv?dokumentet](Bed_Level.md)? for flere detaljer.

source: Location Bias Check
nb_no: Posisjonsbiassjekk

source: Some probes can have a systemic bias that corrupts the results of the probe at certain toolhead locations. For example, if the probe mount tilts slightly when moving along the Y axis then it could result in the probe reporting biased results at different Y positions.
nb_no: Noen prober kan ha et systemisk bias som forringer resultatet for en probe for gitte verkt?yhodeposisjoner. For eksempel, hvis proben er litt skjev n?r den flytter seg langs Y-aksen, kan dette gi h?yere rapportert hastighet p? forskjellige Y-posisjoner.

source: This is a common issue with probes on delta printers, however it can occur on all printers.
nb_no: Dette er et vanlig problem med proner p? delta-skribere, dog kan det inntreffe p? alle skrivere.

source: One can check for a location bias by using the `PROBE_CALIBRATE` command to measuring the probe z_offset at various X and Y locations. Ideally, the probe z_offset would be a constant value at every printer location.
nb_no: Man kan se etter posisjonsbias ved ? bruke ?PROBE_CALIBRATE?-kommendoen for ? m?le probens z_offset ved forskjellige X- og Y-posisjoner. Ideelt vil probens z_offset v?re en kosntant verdi for hver skriverposisjon.

source: Before starting this test, first calibrate the probe X, Y, and Z offsets as described at the beginning of this document. Then home the printer and navigate to the first XY position. Follow the steps at [calibrating probe Z offset](#calibrating-probe-z-offset) to run the `PROBE_CALIBRATE` command, `TESTZ` commands, and `ACCEPT` command, but do not run `SAVE_CONFIG`. Note the reported z_offset found. Then navigate to the other XY positions, repeat these `PROBE_CALIBRATE` steps, and note the reported z_offset.
nb_no: F?r du starter testen, kalibrerer du f?rst probens X, Y og Z-forskyvning som angitt i begynnelsen av dette dokumentet. Deretter nullstiller du skriveren og navigerer til f?rste XY-posisjon. F?lg stegene i [kalibrering av probeforskyvning for Z](#calibrating-probe-z-offset) og kj?r ?PROBE_CALIBRATE?-kommandoen, ?TESTZ?-kommandoene, og ?ACCEPT?-kommandoen, uten ? kj?re ?SAVE_CONFIG?. Registrer rapportert z_offset. G? s? til de andre XY-posisjonene, gjenta disse ?PROBE_CALIBRATE?-stegene, og registrer rapportert z_offset.

source: Temperature Bias
nb_no: Temperaturbias

source: Many probes have a systemic bias when probing at different temperatures. For example, the probe may consistently trigger at a lower height when the probe is at a higher temperature.
nb_no: Mange prober har et systemisk bias der probing under forskjellige temperaturer. For eksempel kan proben alltid utl?se ved en lavere h?yde n?r den er i h?yere temperatur.

source: It is recommended to run the bed leveling tools at a consistent temperature to account for this bias. For example, either always run the tools when the printer is at room temperature, or always run the tools after the printer has obtained a consistent print temperature. In either case, it is a good idea to wait several minutes after the desired temperature is reached, so that the printer apparatus is consistently at the desired temperature.
nb_no: Det anbefales ? kj?re bunnplateniveleringsverkt?yene i gjevn temperatur for ? ta h?yde for biaset. For eksempel kan du alltid kj?re verkt?yene n?r skriveren er i romtemperatur, eller alltid kj?re verkt?yene etter at skriveren har n?dd driftstemperatur. Uansett er det en god id¨¦ ? vente flere minutter etter at ?nsket temperatur er n?dd, slik at apparatet fungerer som det skal ved ?nsket temperatur.

source: To check for a temperature bias, start with the printer at room temperature and then home the printer, move the head to a position near the center of the bed, and run the `PROBE_ACCURACY` command. Note the results. Then, without homing or disabling the stepper motors, heat the printer nozzle and bed to printing temperature, and run the `PROBE_ACCURACY` command again. Ideally, the command will report identical results. As above, if the probe does have a temperature bias then be careful to always use the probe at a consistent temperature.
nb_no: For ? sjekke temperaturbias, start med skriveren i romtemperatur og nullstill skriveren, flytt hodet til et sted n?r midten av bunnplaten, og kj?r ?PROBE_ACCURACY?-kommandoen. Registrer resultatet. Deretter varmer du opp skrivertuten og bunnplaten til skrivetemperatur, og kj?rer ?PROBE_ACCURACY? (uten ? nullstille eller skru av stepper-motorene). Ideelt vil kommandoen gi identiske resultater. Som ovenfor, er det n?dvendig ? v?re oppmerksom p? at hvis proben har et temperaturbias, vil det v?re bedre ? alltid bruke den ved gjevn temperatur.
